app/Models/Usuarios.php

SELECT *
FROM `persona3`
WHERE `usuario` = 'admin'
---
      public function ObtenerUsuario($data)
      {
         $Usuario = $this -> db -> table ('persona3');
         $Usuario -> where ($data);
         return $Usuario->get()->getResultArray();